In [1]:
# Import dependencies
import json
import pandas as pd
import numpy as np
pd.set_option('display.max_columns', 500)
pd.set_option('display.max_rows', 500)

#database
from sqlalchemy import create_engine
from sqlalchemy import join
from sqlalchemy.sql import select

#from config import db_password
import psycopg2
from config import db_password

In [2]:
# Create database string
db_string = f'postgres://vvqxjory:{db_password}@ziggy.db.elephantsql.com:5432/vvqxjory'

In [3]:
# Create an engine instance
engine = create_engine(db_string)

In [4]:
# Connect to PostgreSQL server
dbConnection = engine.connect()

In [5]:
# Read data from PostgreSQL database table and load into a DataFrame instance
sample_df = pd.read_sql("select * from \"Sample\" where country_id = 32", dbConnection)

In [6]:
sample_df.head()

,sample_id,sample_name,latitude,longitude,rock_name,quartz,feldspar,lithics,p_velocity,density_model,heat_production,heat_production_mass,trace_id,iso_id,comp_id,major_id,rgroup_id,age_id,country_id
0,6611,p3446f2,46.00,-71.00,boninite,NaN,NaN,NaN,NaN,NaN,NaN,NaN,81475,666061,638986,714647,17,43320,32
1,6612,p3031cw,46.00,-71.00,chromitite,NaN,NaN,NaN,NaN,NaN,NaN,NaN,81475,666061,639042,715709,11,43320,32
2,6615,p3102bw,46.00,-71.00,chromitite,NaN,NaN,NaN,NaN,NaN,NaN,NaN,81475,666061,639035,715610,11,43320,32
3,7249,hc-460,49.98,-123.02,basalt transitional,NaN,NaN,NaN,NaN,NaN,NaN,NaN,37701,666061,661994,501036,17,43320,32
4,7250,hc-456,50.00,-123.02,basalt transitional,NaN,NaN,NaN,NaN,NaN,NaN,NaN,37478,666061,661994,478577,17,43320,32